In [1]:
import os

In [2]:
import pandas as pd

In [3]:
from sqlalchemy import create_engine

#### Download neccessary data

In [ ]:
os.system('wget https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-01.csv.gz -O tripdata.csv.gz')

In [6]:
os.system('wget https://s3.amazonaws.com/nyc-tlc/misc/taxi+_zone_lookup.csv -O zones.csv')

--2023-01-25 15:35:08--  https://s3.amazonaws.com/nyc-tlc/misc/taxi+_zone_lookup.csv
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.112.245, 54.231.236.48, 54.231.235.96, ...
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.112.245|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 12322 (12K) [application/octet-stream]
Saving to: ‘zones.csv’

     0K .......... ..                                         100% 1.65M=0.007s

2023-01-25 15:35:09 (1.65 MB/s) - ‘zones.csv’ saved [12322/12322]

0

#### Initialize DB connection and read the CSV file

In [4]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [5]:
reader = pd.read_csv('tripdata.csv.gz', iterator=True, chunksize=100000)

In [6]:
df = next(reader, None)

#### Prepare the TripData dataframe for SQL insertion

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 20 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   VendorID               100000 non-null  int64
 1   lpep_pickup_datetime   100000 non-null  object
 2   lpep_dropoff_datetime  100000 non-null  object
 3   store_and_fwd_flag     100000 non-null  object
 4   RatecodeID             100000 non-null  int64
 5   PULocationID           100000 non-null  int64
 6   DOLocationID           100000 non-null  int64
 7   passenger_count        100000 non-null  int64
 8   trip_distance          100000 non-null  float64
 9   fare_amount            100000 non-null  float64
 10  extra                  100000 non-null  float64
 11  mta_tax                100000 non-null  float64
 12  tip_amount             100000 non-null  float64
 13  tolls_amount           100000 non-null  float64
 14  ehail_fee              0 non-null       float64
 15  improvement_surcharge  100000 non-null  float64
 16  total_amount           100000 non-null  float64
 17  payment_type           100000 non-null  int64
 18  trip_type              100000 non-null  int64
 19  congestion_surcharge   6 non-null       float64
dtypes: float64(10), int64(7), object(3)
memory usage: 15.3+ MB

In [8]:
df.size

2000000

In [9]:
df.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2018-12-21 15:17:29,2018-12-21 15:18:57,N,1,264,264,5,0.00,3.0,0.5,0.5,0.00,0.0,NaN,0.3,4.30,2,1,NaN
1,2,2019-01-01 00:10:16,2019-01-01 00:16:32,N,1,97,49,2,0.86,6.0,0.5,0.5,0.00,0.0,NaN,0.3,7.30,2,1,NaN
2,2,2019-01-01 00:27:11,2019-01-01 00:31:38,N,1,49,189,2,0.66,4.5,0.5,0.5,0.00,0.0,NaN,0.3,5.80,1,1,NaN
3,2,2019-01-01 00:46:20,2019-01-01 01:04:54,N,1,189,17,2,2.68,13.5,0.5,0.5,2.96,0.0,NaN,0.3,19.71,1,1,NaN
4,2,2019-01-01 00:19:06,2019-01-01 00:39:43,N,1,82,258,1,4.53,18.0,0.5,0.5,0.00,0.0,NaN,0.3,19.30,2,1,NaN

In [10]:
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

#### Create table and insert data into Postgres

In [11]:
df.head(0).to_sql(name='tripdata', con=engine, if_exists='replace')

0

In [13]:
df.to_sql(name='tripdata', con=engine, if_exists='append')
print('inserted first chunk')

1000

In [14]:
while (df := next(reader, None)) is not None:
    df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
    df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
    df.to_sql(name='tripdata', con=engine, if_exists='append')
    print('inserted next chunk')
print('inserting finished')

inserted next chunk
inserted next chunk
inserted next chunk
inserted next chunk
inserted next chunk
inserted next chunk
inserting finished

#### Prepare zones dataframe for SQL insertion

In [21]:
df = pd.read_csv('zones.csv')

In [22]:
df.size

1060

In [23]:
df.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

#### Insert zones

In [24]:
df.head(0).to_sql(name='zones', con=engine, if_exists='replace')

0

In [25]:
df.to_sql(name='zones', con=engine, if_exists='append')
print('inserted zones')

inserted zones